// © Copyright 2012-2013, 2015-2016 HP Development Company, L.P.

// Task name & description
HSDTaskName = "Ajustes del servidor proxy";
HSDTaskDescription = "La impresora admite conexión a Internet. Si utiliza un servidor proxy para conectarse a Internet, configure los ajustes siguientes.";
TaskDescriptionInAssistantMode = "Para conectar a Servicios Web HP, la impresora se deberá conectar a Internet. Si utiliza un servidor proxy para conectarse a Internet, introduzca la configuración siguiente.\n\nSi no conoce su configuración proxy, consulte la configuración en el panel de preferencias de red o contacte con el administrador del sistema.";

// Radio buttons matrix
HSDProxyServerNotRequiredTitle = "No se requiere un servidor proxy para conectarse a Internet";
HSDAutomaticProxySettingsTitle = "Automático (el dispositivo detectará los ajustes de manera automática)";
HSDCustomProxySettingsTitle = "Configuración personalizada del servidor proxy:";
HSDSystemProxySettingsTitle = "Copiar ajustes del sistema";

// Proxy server settings
HSDProxyServerTitle = "Servidor Proxy:";
ProxyPortTitle = "Puerto proxy:";

// Authentication
HSDRequiresAuthenticationButton = "El servidor proxy requiere autenticación";
HSDUserNameTitle = "Nombre de usuario:";
HSDPasswordTitle = "Contraseña:";

HSDApplyNowButtonTitle = "Aplicar ahora";

// progress titles
UpdateInformationProcessTitle = "Actualizando información...";

// alerts
EmptyProxyServerOrPortErrorText = "El servidor proxy y el puerto proxy deben especificarse.";

EmptyUserNameOrPasswordErrorText = "La autenticación del servidor proxy requiere que se especifiquen el nombre de usuario y la contraseña.";

IncorrectProxyServerNameFormatErrorText = "Error al establecer el nombre del servidor proxy. Compruebe si el formato es válido.";

HSDUserNameTooLargeErrorText = "El nombre de usuario es demasiado largo. Su dispositivo admite un máximo de %d caracteres en un nombre de usuario.";
